---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ElectricalAnalyticalLoadSetUIService
source: html/378fa29c-ace2-e1d6-e558-729a9f1b8bd8.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ElectricalAnalyticalLoadSetUIService Property

The UI service which permits registration of an external server for UI managing Electrical Analytical Load Set.

## Syntax (C#)
```csharp
public static ExternalServiceId ElectricalAnalyticalLoadSetUIService { get; }
```